OdGeVector3d.op_Implicit~OdGeMatrix3d
\details
Returns the equivalent 3D tranformation matrix.

OdGeVector3d.set(OdGePlanarEnt!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGeVector2d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Sets this vector to the specified arguments,
and returns a reference to this vector.
\param vect [in]  Any 2D vector.
\param plane [in]  Any plane.
\remarks
When called with plane and vector, constructs
the 3D vector correspoponding to the 2D vector
in the coordinates of the plane:
uAxis * vect.x + vAxis * vect.y
where uAxis and vAxis are returned by
plane.get(origin, uAxis, vAxis)
The 3D vector will be parallel to the 2D vector.

OdGeVector3d.set(System.Double,System.Double,System.Double)
\details
Sets this vector to the specified arguments,
and returns a reference to this vector.
\param xx [in]  X-coordinate.
\param yy [in]  Y-coordinate.
\param zz [in]  Z-coordinate.

OdGeVector3d.largestElement
\details
Returns the index of the largest absolute coordinate of this vector.

OdGeVector3d.op_Subscript(System.UInt32)
\details
Returns the ith coordinate of this vector.
\param i [in]  Index of coordinate.
\remarks
* 0 returns the X-coordinate.
* 1 returns the Y-coordinate.
* 2 returns the Z-coordinate.
\details
References the ith coordinate of this vector.
\param i [in]  Index of coordinate.
\remarks
* 0 references the X-coordinate.
* 1 references the Y-coordinate.
* 2 references the Z-coordinate.

OdGeVector3d.isEqualTo(OdGeVector3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGeTol!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns true if and only if vect is identical to this vector,
within the specified tolerance.
\param vect [in]  Any 3D vector.
\param tol [in]  Geometric tolerance.

OdGeVector3d.op_Inequality(OdGeVector3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Inequality operator for the OdGeVector3d class.
\param vect [in]   A 3D vector to be compared.
\remarks
Returns true if passed vector is not equal to this vector.

OdGeVector3d.op_Equality(OdGeVector3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Equality operator for the OdGeVector3d class.
\param vect [in]   A 3D vector to be compared.
\remarks
Returns true if passed vector is equal to this vector.

OdGeVector3d.orthoProject(OdGeVector3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGeTol!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGe.ErrorCondition*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns a 3D vector which is the result of the orthogonal projection of this vector into the plane with normal planeNormal passing through the origin.
\param planeNormal [in]  A 3D vector which is a normal vector of a plane on which this vector is projected.
\param tol [in]  Geometric tolerance.
\param flag [in]  A flag that displays if method executed successfully.
\remarks
The flag is set to kOk value if method executed successfully, otherwise it is set to k0Arg1 value.

OdGeVector3d.orthoProject(OdGeVector3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns a 3D vector which is the result of the orthogonal projection of this vector into the plane with normal planeNormal passing through the origin.
\param planeNormal [in]  A 3D vector which is a normal vector of a plane on which this vector is projected.

OdGeVector3d.project(OdGeVector3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGeVector3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGeTol!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGe.ErrorCondition*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns a 3D vector which is the result of the projection of this vector in given projectDirection into the plane with normal planeNormal passing through the origin.
\param planeNormal [in]  A 3D vector which is a normal vector of a plane on which this vector is projected.
\param projectDirection [in]  A projection direction.
\param tol [in]  Geometric tolerance.
\param flag [in]  A flag that displays if method executed successfully.
\remarks
Possible values for flag are as follows:
@untitled table
kOk
k0Arg1
k0Arg2
kPerpendicularArg1Arg2

OdGeVector3d.project(OdGeVector3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGeVector3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns a 3D vector which is the result of the projection of this vector in given projectDirection into the plane with normal planeNormal passing through the origin.
\param planeNormal [in]  A 3D vector which is a normal vector of a plane on which this vector is projected.
\param projectDirection [in]  A projection direction.

OdGeVector3d.crossProduct(OdGeVector3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns the cross product of this vector and the specified vector.
\param vect [in]  Any 3D vector.

OdGeVector3d.dotProduct(OdGeVector3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns the dot product of this vector and the specified vector.
\param vect [in]  Any 3D vector.

OdGeVector3d.isPerpendicularTo(OdGeVector3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGeTol!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns true if and only if the specified vector is perpendicular to this vector within the specified tolerance.
\param vect [in]  Any 3D vector.
\param tol [in]  Geometric tolerance.

OdGeVector3d.isCodirectionalTo(OdGeVector3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGeTol!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns true if and only if the specified vector is codirectional to this vector within the specified tolerance.
\param vect [in]  Any 3D vector.
\param tol [in]  Geometric tolerance.

OdGeVector3d.isParallelTo(OdGeVector3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGeTol!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns true if and only if the specified vector is parallel to this vector within the specified tolerance.
\param vect [in]  Any 3D vector.
\param tol [in]  Geometric tolerance.

OdGeVector3d.isZeroLength(OdGeTol!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns true if and only if the length of this vector is 0.0 within the specified tolerance.
\param tol [in]  Geometric tolerance.

OdGeVector3d.isUnitLength(OdGeTol!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns true if and only if the length of this vector is 1.0 within the specified tolerance.
\param tol [in]  Geometric tolerance.

OdGeVector3d.lengthSqrd
\details
Returns the square of the length of this vector.

OdGeVector3d.setLength(System.Double)
\details
Sets the length of this vector.
\param length [in]  Vector length.

OdGeVector3d.length
\details
Returns the length of this vector.

OdGeVector3d.angleOnPlane(OdGePlanarEnt!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns the angle of this vector projected onto
the specified plane
\param plane [in]  Any 3D plane.
\remarks
This vector is projected orthogonally onto the
plane through its origin, and is measured with
respect to axis1 as returned by
plane.getCoordSystem(origin, axis1, axis2)

OdGeVector3d.angleTo(OdGeVector3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns the angle to the specified vector.
\param vect [in]  Any 3D vector.
\returns
angle to the specified vector in radians as a double value.
\remarks
* Returns a value in the range [0.0 .. OdaPI].
* This function is commutative.

OdGeVector3d.perpVector
\details
Returns a vector perpendicular to this one.
\remarks
The orthogonal vector is determined by function OdGeContext::gOrthoVector()

OdGeVector3d.negate
\details
Negates this vector (-x, -y, -z), and returns a reference to this vector.

OdGeVector3d.op_UnaryNegation
\details
Returns a vector with inverted X, Y and Z coordinates.
\returns
Vector opposite to this vector.

OdGeVector3d.setToSum(OdGeVector3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGeVector3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Sets this vector to vector1 + vector1, and returns a reference to this vector.
\param vector1 [in]  Any 3D vector.
\param vector2 [in]  Any 3D vector.

OdGeVector3d.asPoint
\details
Returns this vector as a point.
\details
Returns this vector as a point.

OdGeVector3d.op_SubtractionAssignment(OdGeVector3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Subtraction operator for the OdGeVector3d class.
\param vect [in]   A 3D vector to be subtracted.
\remarks
Returns a vector that is created by subtracting coordinates of the passed vector from the coordinates of this vector.

OdGeVector3d.op_Subtraction(OdGeVector3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Subtraction operator for the OdGeVector3d class.
\param vect [in]  A 3D vector to be subtracted.
\remarks
Returns a vector that is created by subtracting coordinates of the passed vector from the coordinates of this vector.

OdGeVector3d.op_AdditionAssignment(OdGeVector3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Addition operator for the OdGeVector3d class.
\param vect [in]   A 3D vector to be added.
\remarks
Adds coordinates of the specified vector to the coordinates of this vector and returns a reference to this vector.

OdGeVector3d.op_Addition(OdGeVector3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Addition operator for the OdGeVector3d class.
\param vect [in]  A 3D vector to be added.
\remarks
Returns a vector that is created by adding coordinates of this vector to the coordinates of the specified vector.

OdGeVector3d.op_DivisionAssignment(System.Double)
\details
Division operator for the OdGeVector3d class.
\param scale [in]  Scale factor.
\remarks
Divides coordinates of this vector by the scale factor and returns reference to this vector.

OdGeVector3d.op_Division(System.Double)
\details
Division operator for the OdGeVector3d class.
\param scale [in]  Scale factor.
\remarks
Returns a vector with divided coordinates of this vector by the scale factor.

OdGeVector3d.op_MultiplicationAssignment(System.Double)
\details
Multiplication operator for the OdGeVector3d class.
\param scale [in]  Scale factor.
\remarks
Multiplies coordinates of this vector by the scale factor and returns reference to this vector.

OdGeVector3d.op_Multiply(System.Double)
\details
Multiplication operator for the OdGeVector3d class.
\param scale [in]  Scale factor.
\remarks
Returns a vector with multiplied coordinates of this vector by the scale factor.

OdGeVector3d.convert2d
\details
Returns the 2D vector, in the coordinate system
of the XY plane, corresponding to the 3D vector.
\remarks
The 3D vector must be parallel to the XY plane.

OdGeVector3d.convert2d(OdGePlanarEnt!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns the 2D vector, in the coordinate system
of the plane, corresponding to the 3D vector.
\param plane [in]  The planar entity on which the converted vector will be projected.
\remarks
The 3D vector must be parallel to the plane.

OdGeVector3d.mirror(OdGeVector3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Mirrors the entity about the plane passing through the
origin with the specified normal, and returns
a reference to the entity.
\param normalToPlane [in]  Normal to Plane.

OdGeVector3d.rotateBy(System.Double,OdGeVector3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Rotates this vector the specified angle
about the specified axis,
and returns a reference to this vector.
\param angle [in]  Rotation angle.
\param axis [in]  Axis of rotation.

OdGeVector3d.transformBy(OdGeMatrix3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Applies the 3D transformation matrix to this vector.
\param xfm [in]  3D transformation matrix.

OdGeVector3d.setToProduct(OdGeVector3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,System.Double)
\details
Sets this vector to the product scale * vect and returns
a reference to this vector.
\param vect [in]  Any 3D vector.
\param scale [in]  Scale factor.

OdGeVector3d.setToProduct(OdGeMatrix3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGeVector3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Sets this vector to the product matrix * vect and returns
a reference to this vector.
\param matrix [in]  Any 3D matrix.
\param vect [in]  Any 3D vector.

OdGeVector3d.#ctor(OdGePlanarEnt!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGeVector2d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Constructor for the OdGeVector3d class.
\param plane [in]  2D plane.
\param vector2d [in]  2D vector.
\remarks
Constructs  the 3D vector correspoponding to the 2D vector in the coordinates of the plane:
uAxis * vect.x + vAxis * vect.y
where uAxis and vAxis are returned by
plane.get(origin, uAxis, vAxis)

OdGeVector3d.#ctor(System.Double,System.Double,System.Double)
\details
Constructor for the OdGeVector3d class.
\param xx [in]  X-coordinate.
\param yy [in]  Y-coordinate.
\param zz [in]  Z-coordinate.
\remarks
Constructs a 3D vector with specified X, Y and Z coordinates.

OdGeVector3d.#ctor
\details
Default constructor for the OdGeVector3d class.
\remarks
Constructs a zero-length 3D vector.